Revit 2027 API
BuiltInFailures.MEPFabricationFailures.NotAllPartsWereConvertedUnsuportedFittingOffsets Property
 Not all parts were converted. Eccentric transitions and taps that have offsets from the center line are unsupported and cannot be converted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotAllPartsWereConvertedUnsuportedFittingOffsets { get; }
Public Shared ReadOnly Property NotAllPartsWereConvertedUnsuportedFittingOffsets As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotAllPartsWereConvertedUnsuportedFittingOffsets {
	FailureDefinitionId^ get ();
}
static member NotAllPartsWereConvertedUnsuportedFittingOffsets : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace